[{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/3/26/0/IE0309_French-Toast.jpg.rend.hgtvcom.826.620.suffix/1431730431340.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/robert-irvine/french-toast-recipe-1951408","totalTime":"20 min","rating":"4.7 of 5 stars","ingredients":["1 teaspoon ground cinnamon","1/4 teaspoon ground nutmeg","2 tablespoons sugar","4 tablespoons butter","4 eggs","1/4 cup milk","1/2 teaspoon vanilla extract","8 slices challah, brioche, or white bread","1/2 cup maple syrup, warmed"],"reviewNumber":749,"title":"French Toast","steps":["In a small bowl, combine cinnamon, nutmeg, and sugar and set aside briefly.","In a 10-inch or 12-inch skillet, melt butter over medium heat. Whisk together cinnamon mixture, eggs, milk, and vanilla and pour into a shallow container such as a pie plate. Dip bread in egg mixture. Fry slices until golden brown, then flip to cook the other side. Serve with syrup."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/4/7/1/CL9455_no-bake-cookies_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371597379025.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/food-network-kitchen/peanut-butter-chocolate-no-bake-cookies-recipe-2015085","totalTime":"40 min","rating":"4.5 of 5 stars","ingredients":["2 cups sugar","1/2 cup milk","1 stick (8 tablespoons) unsalted butter","1/4 cup unsweetened cocoa powder","3 cups old-fashioned rolled oats","1 cup smooth peanut butter","1 tablespoon pure vanilla extract","Large pinch kosher salt"],"reviewNumber":1027,"title":"Peanut Butter-Chocolate No-Bake Cookies","steps":["Line a baking sheet with wax paper or parchment.","Bring the sugar, milk, butter and cocoa to a boil in a medium saucepan over medium heat, stirring occasionally, then let boil for 1 minute. Remove from the heat. Add the oats, peanut butter, vanilla and salt, and stir to combine.","Drop teaspoonfuls of the mixture onto the prepared baking sheet, and let sit at room temperature until cooled and hardened, about 30 minutes. Refrigerate in an airtight container for up to 3 days."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/11/12/0/12-Days-of-Cookies_sugar-cookies-012_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382540976299.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/alton-brown/sugar-cookies-recipe-1914697","totalTime":"15 min","rating":"4.3 of 5 stars","ingredients":["3 cups all-purpose flour","3/4 teaspoon baking powder","1/4 teaspoon salt","1 cup unsalted butter, softened","1 cup sugar","1 egg, beaten","1 tablespoon milk","Powdered sugar, for rolling out dough"],"reviewNumber":1483,"title":"Sugar Cookies","steps":["Sift together flour, baking powder, and salt. Set aside. Place butter and sugar in large bowl of electric stand mixer and beat until light in color. Add egg and milk and beat to combine. Put mixer on low speed, gradually add flour, and beat until mixture pulls away from the side of the bowl. Divide the dough in half, wrap in waxed paper, and refrigerate for 2 hours.","Preheat oven to 375 degrees F.","Sprinkle surface where you will roll out dough with powdered sugar. Remove 1 wrapped pack of dough from refrigerator at a time, sprinkle rolling pin with powdered sugar, and roll out dough to 1/4-inch thick. Move the dough around and check underneath frequently to make sure it is not sticking. If dough has warmed during rolling, place cold cookie sheet on top for 10 minutes to chill. Cut into desired shape, place at least 1-inch apart on greased baking sheet, parchment, or silicone baking mat, and bake for 7 to 9 minutes or until cookies are just beginning to turn brown around the edges, rotating cookie sheet halfway through baking time. Let sit on baking sheet for 2 minutes after removal from oven and then move to complete cooling on wire rack. Serve as is or ice as desired. Store in airtight container for up to 1 week."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/4/13/0/GC_banana-bread_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371592847747.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/banana-bread-recipe-1969572","totalTime":"1 hr 40 min","rating":"4.7 of 5 stars","ingredients":["1 cup granulated sugar","8 tablespoons (1 stick) unsalted butter, room temperature","2 large eggs","3 ripe bananas","1 tablespoon milk","1 teaspoon ground cinnamon","2 cups all-purpose flour","1 teaspoon baking powder","1 teaspoon baking soda","1 teaspoon salt"],"reviewNumber":1395,"title":"Banana Bread","steps":["Preheat the oven to 325 degrees F. Butter a 9 x 5 x 3 inch loaf pan.","Cream the sugar and butter in a large mixing bowl until light and fluffy. Add the eggs one at a time, beating well after each addition.","In a small bowl, mash the bananas with a fork. Mix in the milk and cinnamon. In another bowl, mix together the flour, baking powder, baking soda and salt.","Add the banana mixture to the creamed mixture and stir until combined. Add dry ingredients, mixing just until flour disappears.","Pour batter into prepared pan and bake 1 hour to 1 hour 10 minutes, until a toothpick inserted in the center comes out clean. Set aside to cool on a rack for 15 minutes. Remove bread from pan, invert onto rack and cool completely before slicing.","Spread slices with honey or serve with ice cream."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2008/6/9/0/CI0103_Classic-Deviled-Eggs.jpg.rend.hgtvcom.826.620.suffix/1479929974560.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/classic-deviled-eggs-recipe-1911032","totalTime":"20 min","rating":"4.2 of 5 stars","ingredients":["6 eggs","1/4 cup mayonnaise","1 teaspoon white vinegar","1 teaspoon yellow mustard","1/8 teaspoon salt","Freshly ground black pepper","Smoked Spanish paprika, for garnish"],"reviewNumber":391,"title":"Classic Deviled Eggs","steps":["Place eggs in a single layer in a saucepan and cover with enough water that there's 1 1/2 inches of water above the eggs. Heat on high until water begins to boil, then cover, turn the heat to low, and cook for 1 minute. Remove from heat and leave covered for 14 minutes, then rinse under cold water continuously for 1 minute.","Crack egg shells and carefully peel under cool running water. Gently dry with paper towels. Slice the eggs in half lengthwise, removing yolks to a medium bowl, and placing the whites on a serving platter. Mash the yolks into a fine crumble using a fork. Add mayonnaise, vinegar, mustard, salt, and pepper, and mix well.","Evenly disperse heaping teaspoons of the yolk mixture into the egg whites. Sprinkle with paprika and serve."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/7/26/2/GT0303_pizza-dough_s4x3.jpg.rend.hgtvcom.826.620.suffix/1433073345479.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/bobby-flay/pizza-dough-recipe-1921714","totalTime":"20 min","rating":"4.7 of 5 stars","ingredients":["3 1/2 to 4 cups bread flour, plus more for rolling","1 teaspoon sugar","1 envelope instant dry yeast","2 teaspoons kosher salt","1 1/2 cups water, 110 degrees F","2 tablespoons olive oil, plus 2 teaspoons"],"reviewNumber":1230,"title":"Pizza Dough","steps":["Combine the bread flour, sugar, yeast and kosher salt in the bowl of a stand mixer and combine. While the mixer is running, add the water and 2 tablespoons of the oil and beat until the dough forms into a ball. If the dough is sticky, add additional flour, 1 tablespoon at a time, until the dough comes together in a solid ball. If the dough is too dry, add additional water, 1 tablespoon at a time. Scrape the dough onto a lightly floured surface and gently knead into a smooth, firm ball.","Grease a large bowl with the remaining 2 teaspoons olive oil, add the dough, cover the bowl with plastic wrap and put it in a warm area to let it double in size, about 1 hour. Turn the dough out onto a lightly floured surface and divide it into 2 equal pieces. Cover each with a clean kitchen towel or plastic wrap and let them rest for 10 minutes."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2003/9/29/0/ig1a07_roasted_potatoes.jpg.rend.hgtvcom.826.620.suffix/1446840363593.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/ina-garten/garlic-roasted-potatoes-recipe-1913067","totalTime":"10 min","rating":"4.7 of 5 stars","ingredients":["3 pounds small red or white potatoes","1/4 cup good olive oil","1 1/2 teaspoons kosher salt","1 teaspoon freshly ground black pepper","2 tablespoons minced garlic (6 cloves)","2 tablespoons minced fresh parsley"],"reviewNumber":674,"title":"Garlic Roasted Potatoes","steps":["Preheat the oven to 400 degrees F.","Cut the potatoes in half or quarters and place in a bowl with the olive oil, salt, pepper, and garlic; toss until the potatoes are well coated. Transfer the potatoes to a sheet pan and spread out into 1 layer. Roast in the oven for 45 minutes to 1 hour or until browned and crisp. Flip twice with a spatula during cooking in order to ensure even browning.","Remove the potatoes from the oven, toss with parsley, season to taste, and serve hot."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2012/8/13/1/WU-0106_cheesy-baked-potatoes_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382375911904.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/pie-baked-apples-2615840","totalTime":"30 min","rating":"4.8 of 5 stars","ingredients":["8 baking potatoes, washed","3 tablespoons canola oil","2 sticks salted butter","1 cup bacon bits (fry your own!)","1 cup sour cream","1 cup Cheddar or Jack cheese (or a mix of both), plus more for topping","1 cup whole milk","2 teaspoons seasoned salt","3 green onions, sliced","Freshly ground black pepper"],"reviewNumber":404,"title":"Twice-Baked Potatoes","steps":["Preheat the oven to 400 degrees F.","Place the potatoes on a baking sheet. Rub them with the canola oil and bake for 1 hour, making sure they're sufficiently cooked through.","Slice the butter into pats. Place in a large mixing bowl and add the bacon bits and sour cream. Remove the potatoes from the oven. Lower the heat to 350 degrees F.","With a sharp knife, cut each potato in half lengthwise. Scrape out the insides into the mixing bowl, being careful not to tear the shell. Leave a small rim of potato intact for support. Lay the hollowed out potato shells on a baking sheet.","Smash the potatoes into the butter, bacon and sour cream. Add the cheese, milk, seasoned salt, green onions and black pepper to taste and mix together well. (IMPORTANT: If you plan to freeze the twice-baked potatoes, do NOT add the green onions.)","Fill the potato shells with the filling. I like to fill the shells so they look abundant and heaping. Top each potato with a little more grated cheese and pop 'em in the oven until the potato is warmed through, 15 to 20 minutes."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2009/11/1/0/BX0207_Lobster-Mac-and-Cheese_s4x3.jpg.rend.hgtvcom.826.620.suffix/1637359401154.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/ree-drummond/twice-baked-potatoes-recipe-1925596","totalTime":"15 min","rating":"4.5 of 5 stars","ingredients":["Kosher salt","Vegetable oil","1 pound cavatappi or elbow macaroni","1 quart milk","8 tablespoons (1 stick) unsalted butter, divided","1/2 cup all-purpose flour","12 ounces Gruyere cheese, grated (4 cups)","8 ounces extra-sharp Cheddar, grated (2 cups)","1/2 teaspoon freshly ground black pepper","1/2 teaspoon nutmeg","1 1/2 pounds cooked lobster meat","1 1/2 cups fresh white bread crumbs (5 slices, crusts removed)"],"reviewNumber":357,"title":"Lobster Mac and Cheese","steps":["Preheat the oven to 375 degrees F.","Drizzle oil into a large pot of boiling salted water. Add the pasta and cook according to the directions on the package, 6 to 8 minutes. Drain well.","Meanwhile, heat the milk in a small saucepan, but don't boil it. In a large pot, melt 6 tablespoons of butter and add the flour. Cook over low heat for 2 minutes, stirring with a whisk. Still whisking, add the hot milk and cook for a minute or two more, until thickened and smooth. Off the heat, add the Gruyere, Cheddar, 1 tablespoon salt, the pepper, and nutmeg. Add the cooked macaroni and lobster and stir well. Place the mixture in 6 to 8 individual gratin dishes.","Melt the remaining 2 tablespoons of butter, combine them with the fresh bread crumbs, and sprinkle on the top. Bake for 30 to 35 minutes, or until the sauce is bubbly and the macaroni is browned on the top."]},{"imgUrl":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2014/9/19/0/KC0310H_Baked-Apples_s4x3.jpg.rend.hgtvcom.826.620.suffix/1411149931949.jpeg","sourceUrl":"https://www.foodnetwork.com/recipes/ina-garten/lobster-mac-and-cheese-recipe-1948798","totalTime":"1 hr 55 min","rating":"4.3 of 5 stars","ingredients":["4 apples such as Pippin, Mutsu or Braeburn, plus 1 more if needed","1 tablespoon lemon juice","3 tablespoons dark brown sugar","2 tablespoons granulated sugar","1 tablespoon all-purpose flour","1/2 teaspoon cinnamon","1/4 teaspoon freshly grated nutmeg","1/4 teaspoon salt","1 store-bought refrigerator pie crust (half of a 14.1-ounce box)","1 egg, beaten"],"reviewNumber":10,"title":"Pie Baked Apples","steps":["Preheat the oven to 375 degrees F.","Cut the top 1/2 inch from the 4 apples. Using a melon baller or spoon, dig out the insides of the apples and reserve, leaving 1/4 inch flesh next to the skin. Remove the cores and seeds and discard.","Coarsely chop the scooped fruit and add it to a medium bowl; you should have at least 1 1/2 cups. If not, peel, core and dice the additional apple and add it to the bowl. Sprinkle the lemon juice over top and toss to coat. Add the brown sugar, granulated sugar, flour, cinnamon, nutmeg and salt to the bowl and mix. Divide the filling among the hollowed-out apples.","Roll out the pie crust and using a pastry wheel, cut it into 1/4-inch-thick strips. Brush a light coating of egg wash along the top edge of each apple. Weave the strips into a lattice atop each apple, using the egg wash to adhere (see Cook's Note). Lightly brush the top of each lattice with the egg wash.","Place the apples in an 8-by-8-inch baking dish. Add 1 inch of water to the bottom of the dish. Cover with foil and bake for 20 minutes. Remove the foil and bake until the crusts are golden brown and the filling is bubbling, an additional 25 minutes. Place the apples on a cooling rack to cool to room temperature before serving."]}]